In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

%matplotlib inline

In [3]:
suppliers = pd.read_csv("../course-files/northwind-mongo-master/suppliers.csv", usecols=["SupplierID","CompanyName","City"])
suppliers.head()

   SupplierID                         CompanyName         City
0           1                      Exotic Liquids       London
1           2          New Orleans Cajun Delights  New Orleans
2           3           Grandma Kelly's Homestead    Ann Arbor
3           4                       Tokyo Traders        Tokyo
4           5  Cooperativa de Quesos 'Las Cabras'       Oviedo

In [4]:
products = pd.read_csv("../course-files/northwind-mongo-master/products_del_2.csv", usecols=['ProductID','ProductName','SupplierID'])
products.head()

   ProductID                      ProductName  SupplierID
0          1                             Chai           1
1          2                            Chang           1
2          6     Grandma's Boysenberry Spread           3
3          7  Uncle Bob's Organic Dried Pears           3
4          8       Northwoods Cranberry Sauce           3

In [5]:
noprod = suppliers.merge(products, 'left', 'SupplierID', indicator=True)

In [6]:
noprod[noprod._merge == 'left_only']

,SupplierID,CompanyName,City,ProductID,ProductName,_merge
2,2,New Orleans Cajun Delights,New Orleans,NaN,NaN,left_only
67,27,Escargots Nouveaux,Montceau,NaN,NaN,left_only

In [7]:
len(noprod)

70

In [8]:
len(suppliers.merge(products, 'inner', 'SupplierID'))

68

In [10]:
noprod2 = products.merge(suppliers, 'right', 'SupplierID', indicator=True)

In [11]:
noprod2[noprod2._merge == 'right_only']

,ProductID,ProductName,SupplierID,CompanyName,City,_merge
2,NaN,NaN,2,New Orleans Cajun Delights,New Orleans,right_only
67,NaN,NaN,27,Escargots Nouveaux,Montceau,right_only